{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to update TemperaturePanel.tsx's scale bar range to -50°C–+110°C, with associated test ID REQ-17 and high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the micro:bit sensor dashboard.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the BBC micro:bit Sensor Dashboard React app, mounting the app into a root div and loading main.tsx as a module.",
  "frontend/src/App.tsx": "Root React component that wires together Bluetooth and Serial connections, sensor data parsing, history tracking, and renders all dashboard panel components in a responsive grid layout.",
  "frontend/src/components/ATPAPanel.tsx": "Password-protected Admin Transmission Ports Access panel that gates the ConnectionPanel behind a lock/unlock flow with a hardcoded password and optional device location input.",
  "frontend/src/components/BrowserCompatibilityNotice.tsx": "Dismissible amber banner that warns non-Chromium browser users that Web Bluetooth and Web Serial APIs require Chrome or Edge.",
  "frontend/src/components/CompassPanel.tsx": "Glassmorphism compass panel rendering an animated SVG compass needle that rotates via shortest-path interpolation to display the current heading and cardinal direction.",
  "frontend/src/components/ConnectionPanel.tsx": "Renders a connection control panel with Bluetooth and USB Serial connect/disconnect buttons, showing connection status, packet counts, and error messages.",
  "frontend/src/components/DashboardHeader.tsx": "Displays the dashboard header with the micro:bit logo, title, last-update timestamp, and a live/offline connection status indicator.",
  "frontend/src/components/HistoryGraphsPanel.tsx": "Renders a panel of three mini Recharts line graphs showing historical sensor data for temperature, light level, and sound level over time.",
  "frontend/src/components/LightLevelPanel.tsx": "Displays the current light level (0–255) with a labeled horizontal gradient bar, numeric value, and a contextual label (Dark/Dim/Normal/Bright).",
  "frontend/src/components/SoundLevelPanel.tsx": "Shows the current sound level using a segmented vertical bar meter with color-coded segments and a numeric readout labeled Quiet/Normal/Loud.",
  "frontend/src/components/StormDetectionPanel.tsx": "Displays a storm risk indicator with a glowing circular icon (Zap or ShieldCheck) and status text based on a binary stormRisk value.",
  "frontend/src/components/TemperaturePanel.tsx": "Shows both normal and ultra-precise animated temperature readings with a color-coded display and a horizontal scale bar ranging from -50°C to 110°C.",
  "frontend/src/components/WeatherStatusPanel.tsx": "Infers and displays a weather condition (icon, label, description) from sensor data, plus a compact summary grid of temperature, light, and sound values.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAnimatedNumber.ts": "React hook that smoothly animates a numeric value toward a target using requestAnimationFrame with an ease-out cubic easing over a configurable duration.",
  "frontend/src/hooks/useBluetoothConnection.ts": "React hook that manages a Web Bluetooth BLE connection to a micro:bit UART service, handling connect/disconnect lifecycle, notifications, and packet rate tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useSensorDataParser.ts": "React hook that buffers incoming string chunks, extracts and parses complete JSON sensor objects, and throttles delivery of parsed SensorData to a callback at most once per second.",
  "frontend/src/hooks/useSensorHistory.ts": "React hook that maintains a rolling 5-minute history (max 300 points) of temperature, light, and sound sensor readings, providing functions to add data points and clear history.",
  "frontend/src/hooks/useSerialConnection.ts": "React hook that manages a Web Serial API connection, handling port selection, opening at 115200 baud, streaming decoded text chunks via a callback, and tracking packet rate and connection status.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS with custom CSS variables for a dark sci-fi dashboard theme, and defines animated background, gradient overlay, and glow utility styles.",
  "frontend/src/main.tsx": "React app entry point that mounts the App component wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/types/sensor.ts": "TypeScript type definitions for sensor data fields, connection state, connection method, and history data points used throughout the frontend.",
  "frontend/src/utils/weatherInference.ts": "Utility function that infers a weather condition label, icon, color, and description from SensorData based on temperature, light level, and storm flag.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Orbitron, JetBrains Mono, Inter), extended colors using oklch CSS variables, dashboard-specific semantic colors, border radii, box shadows, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state document (version 7) describing the micro:bit sensor dashboard architecture, existing features, known issues, and design decisions including glassmorphism UI, BLE/Serial connectivity, and sensor data display."
}