{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (ATPA panel login, ConnectionPanel embedding, device location input) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, describing each file's purpose within the micro:bit sensor dashboard.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, borders, and chart palette variables.",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the root div and loading the Vite/TSX entry point for the BBC micro:bit Sensor Dashboard.",
  "frontend/src/App.tsx": "Root React component that wires together BLE and Serial connection hooks, sensor data parsing, history tracking, and renders all dashboard panels including the ATPAPanel in place of a standalone ConnectionPanel.",
  "frontend/src/components/ATPAPanel.tsx": "Glassmorphism admin panel implementing password-gated access (password '2AKFPMB0220') that shows a login form when locked and renders the ConnectionPanel plus a device location input when unlocked.",
  "frontend/src/components/BrowserCompatibilityNotice.tsx": "Dismissible amber banner component that detects non-Chromium browsers and warns users that Web Bluetooth and Web Serial require Chrome or Edge.",
  "frontend/src/components/CompassPanel.tsx": "Renders an animated SVG compass rose that rotates a needle to display the current heading, using shortest-path interpolation to avoid spinning the wrong way. Shows cardinal/intercardinal direction labels and a degree-tick ring.",
  "frontend/src/components/ConnectionPanel.tsx": "Displays Bluetooth and USB Serial connection controls with connect/disconnect buttons, connection status indicator, packet counts, and error messages. Disables one transport's button when the other is active or connecting.",
  "frontend/src/components/DashboardHeader.tsx": "Top-level header bar showing the micro:bit logo, dashboard title, time since last data update, and a live/offline connection status indicator.",
  "frontend/src/components/HistoryGraphsPanel.tsx": "Renders a panel of three small Recharts line graphs (temperature, light, sound) with time-ago x-axis labels, downsampling for performance, and a custom tooltip. Shows a placeholder message when no history data is available.",
  "frontend/src/components/LightLevelPanel.tsx": "Shows the current light level (0–255) as a numeric value, a color-coded horizontal progress bar with gradient, and scale tick marks labeled Dark/Dim/Normal/Bright.",
  "frontend/src/components/SoundLevelPanel.tsx": "Displays the current sound level via a segmented vertical bar meter (12 segments color-coded green/cyan/red) alongside a numeric readout and Quiet/Normal/Loud labels.",
  "frontend/src/components/StormDetectionPanel.tsx": "Shows a binary storm-risk indicator with a glowing circular icon (Zap for high risk, ShieldCheck for low) and descriptive status text, styled with red or green color themes based on the risk value.",
  "frontend/src/components/TemperaturePanel.tsx": "React component that displays normal and ultra-precise temperature readings with animated values, color-coded by temperature range, and a visual scale bar.",
  "frontend/src/components/WeatherStatusPanel.tsx": "React component that infers and displays a weather condition (icon, label, description) from sensor data, along with a summary of temperature, light, and sound values.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and returns an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnimatedNumber.ts": "Custom hook that smoothly animates a number from its current value to a target value using requestAnimationFrame with an ease-out cubic curve.",
  "frontend/src/hooks/useBluetoothConnection.ts": "Custom hook that manages a Web Bluetooth BLE connection to a micro:bit UART service, handling connect/disconnect, notifications, and packet rate tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useSensorDataParser.ts": "Custom hook that buffers incoming BLE text chunks, extracts and parses complete JSON sensor objects, and throttles data delivery to at most once per second.",
  "frontend/src/hooks/useSensorHistory.ts": "Custom hook that maintains a rolling 5-minute history (up to 300 points) of temperature, light, and sound sensor readings with add and clear operations.",
  "frontend/src/hooks/useSerialConnection.ts": "React hook that manages a Web Serial API connection, handling port selection, opening at 115200 baud, streaming text data via TextDecoderStream, and tracking connection status and packet rate.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a dark glassmorphism theme, and providing animated gradient background and utility classes for the dashboard.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/sensor.ts": "TypeScript type definitions for sensor data fields, connection state, connection method, and history data points used throughout the dashboard.",
  "frontend/src/utils/weatherInference.ts": "Utility function that maps SensorData (temperature, light, storm flag) to a human-readable WeatherCondition with label, icon, color, and description.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Orbitron, JetBrains Mono, Inter), OKLCH-based semantic color tokens, dashboard-specific colors, border radii, and glow box shadows.",
  "project_state.json": "Project state metadata describing the micro:bit sensor dashboard's architecture, existing features, known issues, and versioning for a real-time BLE/Serial glassmorphism web dashboard."
}